### [ 데이터 필터링 ]
- 원하는 데이터를 추출하기 위해서 사용하는 방법
- 원하는 데이터 걸러내겠다는 의미
- 다양한 조건 검사 진행 => 비교 검사 : 같다 ==, 같지 않다 !=, 크다 >, 크거나 같다 >=, 작다 <, 작거나 같다 <=

(1) 모듈 로딩 <hr>

In [4]:
import pandas as pd
import numpy as np

(2) 데이터 준비 <hr>

In [5]:
file='../DATA/employees.csv'

(3) 데이터 저장 <hr>

In [6]:
empDF=pd.read_csv(file)

(4) 데이터 확인 <hr>

- [문제] employees 데이터에서 이름은 Maria인 데이터만 추출

- bool 값으로 구성된 데이터 ==> 불린인덱싱(Boolean Indexing)

In [7]:
empDF["First Name"]=="Maria"

0       False
1       False
2        True
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: First Name, Length: 1001, dtype: bool

In [8]:
empDF[empDF["First Name"]=="Maria"]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

In [9]:
(empDF["First Name"]=="Maria").sum() # 총 True가 6개 있음을 알 수 있다

6

In [10]:
mariaMask=(empDF["First Name"]=="Maria")
empDF[mariaMask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

In [11]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

- [ 문제 ] employees 데이터에서 이름이 연봉이 50000이상인 데이터 추출

In [12]:
mask=empDF["Salary"]>=50000
empDF[mask]

    First Name  Gender Start Date    Salary   Mgmt          Team
1       Thomas    Male    3/31/96   61933.0   True           NaN
2        Maria  Female        NaN  130590.0  False       Finance
3        Jerry     NaN     3/4/05  138705.0   True       Finance
4        Larry    Male    1/24/98  101004.0   True            IT
5       Dennis    Male    4/18/87  115163.0  False         Legal
..         ...     ...        ...       ...    ...           ...
994     George    Male    6/21/13   98874.0   True     Marketing
995      Henry     NaN   11/23/14  132483.0  False  Distribution
997    Russell    Male    5/20/13   96914.0  False       Product
998      Larry    Male    4/20/13   60500.0  False  Business Dev
999     Albert    Male    5/15/12  129949.0   True         Sales

[853 rows x 6 columns]

- 여러 개의 조건이 모두 True여야만 하는 조건 => AND 조건

In [16]:
mask = (empDF['Gender']=='Male') & (empDF['Salary'] >= 148000)
empDF[mask]
mask.sum()

5

In [17]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

In [23]:
empDF["Start Date"]=pd.to_datetime(empDF["Start Date"])# datatime으로 변경하는 메서드(방법1)
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.0+ KB

In [22]:
empDF["Start Date"]=empDF["Start Date"].astype("datetime64[ns]")# datatime으로 변경하는 메서드(방법2)
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.0+ KB

In [25]:
mask=(empDF['Team']=='Sales') | (empDF['Team']=='Legal') | (empDF['Team']=='Marketing') 
empDF[mask]

    First Name  Gender Start Date    Salary   Mgmt       Team
0      Douglas    Male 1993-08-06       NaN   True  Marketing
5       Dennis    Male 1987-04-18  115163.0  False      Legal
11       Julie  Female 1997-10-26  102508.0   True      Legal
13        Gary    Male 2008-01-27  109831.0  False      Sales
20        Lois     NaN 1995-04-22   64714.0   True      Legal
..         ...     ...        ...       ...    ...        ...
986      Donna  Female 1982-11-26   82871.0  False  Marketing
989     Justin     NaN 1991-02-10   38344.0  False      Legal
991       Rose  Female 2002-08-25  134505.0   True  Marketing
994     George    Male 2013-06-21   98874.0   True  Marketing
999     Albert    Male 2012-05-15  129949.0   True      Sales

[280 rows x 6 columns]

In [26]:
empDF['Team'].isin(['Sales','Legal','Marketing'])

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

In [27]:
# 구간 지정 검사 불린 메서드 => DF.between(low, high)
empDF['Salary'].between(80000,90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool